Revit 2027 API
ScheduleFilter.SetValue(Int32) Method
 Set the filter value to an integer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetValue(
	int value
)
Public Sub SetValue (
	value As Integer
)
public:
void SetValue(
	int value
)
member SetValue :
        value : int -> unit
Parameters
value Int32
 The filter value.
See Also
Reference
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace